In [1]:
%env INSTANCE=my

env: INSTANCE=my

In [2]:
!mysql < /home/jupyter/sakila/sakila-database.sql

In [3]:
!mysql < /home/jupyter/sakila/sakila-data.sql

In [4]:
!mysql sakila -e "show tables"

+----------------------------+
| Tables_in_sakila           |
+----------------------------+
| actor                      |
| actor_info                 |
| address                    |
| category                   |
| city                       |
| country                    |
| customer                   |
| customer_list              |
| film                       |
| film_actor                 |
| film_category              |
| film_list                  |
| film_text                  |
| inventory                  |
| language                   |
| nicer_but_slower_film_list |
| payment                    |
| rental                     |
| sales_by_film_category     |
| sales_by_store             |
| staff                      |
| staff_list                 |
| store                      |
+----------------------------+

1. Write queries to get a row count for five of the tables in the database. Include the five SQL statements.

In [5]:
!mysql sakila -e "select count(*) from actor"

+----------+
| count(*) |
+----------+
|      200 |
+----------+

In [6]:
!mysql sakila -e "select count(*) from film_list"

+----------+
| count(*) |
+----------+
|      997 |
+----------+

In [7]:
!mysql sakila -e "select count(*) from nicer_but_slower_film_list"

+----------+
| count(*) |
+----------+
|      997 |
+----------+

In [8]:
!mysql sakila -e "select count(*) from store"

+----------+
| count(*) |
+----------+
|        2 |
+----------+

In [9]:
!mysql sakila -e "select count(*) from staff"

+----------+
| count(*) |
+----------+
|        2 |
+----------+

2. Write five queries to sample a few rows (showing only a few of the columns) from five of the tables, using the LIMIT clause.

In [10]:
!mysql sakila -e "select actor_id, last_name from actor limit 5"

+----------+-----------+
| actor_id | last_name |
+----------+-----------+
|       58 | AKROYD    |
|       92 | AKROYD    |
|      182 | AKROYD    |
|      118 | ALLEN     |
|      145 | ALLEN     |
+----------+-----------+

In [11]:
!mysql sakila -e "select fid, title from film_list limit 5"

+------+------------------+
| fid  | title            |
+------+------------------+
|    1 | ACADEMY DINOSAUR |
|    2 | ACE GOLDFINGER   |
|    3 | ADAPTATION HOLES |
|    4 | AFFAIR PREJUDICE |
|    5 | AFRICAN EGG      |
+------+------------------+

In [12]:
!mysql sakila -e "select fid, title from nicer_but_slower_film_list limit 5"

+------+------------------+
| fid  | title            |
+------+------------------+
|    1 | ACADEMY DINOSAUR |
|    2 | ACE GOLDFINGER   |
|    3 | ADAPTATION HOLES |
|    4 | AFFAIR PREJUDICE |
|    5 | AFRICAN EGG      |
+------+------------------+

In [13]:
!mysql sakila -e "select store_id, address_id from store limit 5"

+----------+------------+
| store_id | address_id |
+----------+------------+
|        1 |          1 |
|        2 |          2 |
+----------+------------+

In [14]:
!mysql sakila -e "select staff_id, last_name from staff limit 5"

+----------+-----------+
| staff_id | last_name |
+----------+-----------+
|        1 | Hillyer   |
|        2 | Stephens  |
+----------+-----------+

3. Write a query (on any one table) that uses both a WHERE clause and an ORDER BY clause. Add a short comment above your SQL statement to describe the query.

In this query, we found all actors with the first name "Penelope" and sorted the entries in alphabetical order by their last names.

In [15]:
!mysql sakila -e "select * from actor where first_name = 'penelope' order by last_name"

+----------+------------+-----------+---------------------+
| actor_id | first_name | last_name | last_update         |
+----------+------------+-----------+---------------------+
|      104 | PENELOPE   | CRONYN    | 2006-02-15 04:34:33 |
|        1 | PENELOPE   | GUINESS   | 2006-02-15 04:34:33 |
|      120 | PENELOPE   | MONROE    | 2006-02-15 04:34:33 |
|       54 | PENELOPE   | PINKETT   | 2006-02-15 04:34:33 |
+----------+------------+-----------+---------------------+

4. Write an INSERT statement to add a row into any one of the tables (*: make sure 
it is not a View by looking at its CREATE statement in the file sakila-
database.sql). Add a short comment above your SQL statement to describe the 
statement.

We added an actor to the actor table: Leonardo Guardicaprio.

In [16]:
!mysql sakila -e "insert into actor values (201, 'Leonardo', 'Guardicaprio', '2023-02-10 17:21:00')"

In [17]:
!mysql sakila -e "select * from actor where first_name = 'leonardo'"

+----------+------------+--------------+---------------------+
| actor_id | first_name | last_name    | last_update         |
+----------+------------+--------------+---------------------+
|      201 | Leonardo   | Guardicaprio | 2023-02-10 17:21:00 |
+----------+------------+--------------+---------------------+

5. Write an UPDATE statement to update one or more rows from any one of the 
tables (*). Add a short comment above your SQL statement to describe the 
statement.

We messed up Leonardo's last name when we inserted it, so this update statement fixed it!

In [ ]:
!mysql sakila -e "update actor set last_name = 'Guardione' where first_name = 'Leonardo'"

In [ ]:
!mysql sakila -e "select * from actor where first_name = 'leonardo'"

6. Write a DELETE statement to delete one or more rows from any one of the tables 
(*). Add a short comment above your SQL statement to describe the statement.

Leonardo has admitted that he stopped acting in middle school and was never in any movies at all. We are deleting him from the actor table.

In [ ]:
!mysql sakila -e "delete from actor where first_name = 'leonardo'"

In [ ]:
!mysql sakila -e "select * from actor where first_name = 'leonardo'"